In [2]:
import pandas as pd
import numpy as np

In [3]:
df=pd.read_csv('data.csv')
df.head()

      Name  Age  Income  Gender
0    Alice   25   50000  Female
1      Bob   30   55000    Male
2  Charlie   35   60000    Male
3    David   28   52000  Female
4      Eva   40   65000  Female

In [4]:
df.describe()

             Age        Income
count   8.000000      8.000000
mean   39.125000  63375.000000
std    12.028983  11005.680352
min    25.000000  50000.000000
25%    29.500000  54250.000000
50%    37.500000  62500.000000
75%    46.250000  71250.000000
max    60.000000  80000.000000

In [5]:
df.dtypes

Name      object
Age        int64
Income     int64
Gender    object
dtype: object

In [6]:
income = df.groupby('Gender')['Income'].describe()
print(income)

        count     mean           std      min      25%      50%      75%  \
Gender
Female    4.0  60500.0  11733.143938  50000.0  51500.0  58500.0  67500.0
Male      4.0  66250.0  11086.778913  55000.0  58750.0  65000.0  72500.0

            max
Gender
Female  75000.0
Male    80000.0

In [7]:
bins=[20,30,40,50,60,100]

labels=['20-30','31-40','41-50','51-60','60+']

df['Age Groups']=pd.cut(df['Age'],bins=bins,labels=labels)
print(df)

      Name  Age  Income  Gender Age Groups
0    Alice   25   50000  Female      20-30
1      Bob   30   55000    Male      20-30
2  Charlie   35   60000    Male      31-40
3    David   28   52000  Female      20-30
4      Eva   40   65000  Female      31-40
5    Frank   45   70000    Male      41-50
6    Grace   50   75000  Female      41-50
7   Hannah   60   80000    Male      51-60

In [8]:
income=df.groupby('Age Groups')['Income'].describe()
print(income)

            count          mean          std      min      25%      50%  \
Age Groups
20-30         3.0  52333.333333  2516.611478  50000.0  51000.0  52000.0
31-40         2.0  62500.000000  3535.533906  60000.0  61250.0  62500.0
41-50         2.0  72500.000000  3535.533906  70000.0  71250.0  72500.0
51-60         1.0  80000.000000          NaN  80000.0  80000.0  80000.0
60+           0.0           NaN          NaN      NaN      NaN      NaN

                75%      max
Age Groups
20-30       53500.0  55000.0
31-40       63750.0  65000.0
41-50       73750.0  75000.0
51-60       80000.0  80000.0
60+             NaN      NaN

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_2288\4240129346.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  income=df.groupby('Age Groups')['Income'].describe()

In [9]:
data=pd.read_csv('iris.csv')
data.head()

   sepal_length  sepal_width  petal_length  petal_width        class
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa

In [10]:
data.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [11]:
gr=data.groupby('class')
se=gr.get_group('Iris-setosa')
ve=gr.get_group('Iris-versicolor')
vi=gr.get_group('Iris-virginica')

In [12]:
print(se.shape)
print(ve.shape)
print(vi.shape)

(50, 5)
(50, 5)
(50, 5)

In [13]:
se.describe()

       sepal_length  sepal_width  petal_length  petal_width
count      50.00000    50.000000     50.000000     50.00000
mean        5.00600     3.418000      1.464000      0.24400
std         0.35249     0.381024      0.173511      0.10721
min         4.30000     2.300000      1.000000      0.10000
25%         4.80000     3.125000      1.400000      0.20000
50%         5.00000     3.400000      1.500000      0.20000
75%         5.20000     3.675000      1.575000      0.30000
max         5.80000     4.400000      1.900000      0.60000

In [14]:
ve.describe()

       sepal_length  sepal_width  petal_length  petal_width
count     50.000000    50.000000     50.000000    50.000000
mean       5.936000     2.770000      4.260000     1.326000
std        0.516171     0.313798      0.469911     0.197753
min        4.900000     2.000000      3.000000     1.000000
25%        5.600000     2.525000      4.000000     1.200000
50%        5.900000     2.800000      4.350000     1.300000
75%        6.300000     3.000000      4.600000     1.500000
max        7.000000     3.400000      5.100000     1.800000

In [15]:
vi.describe()

       sepal_length  sepal_width  petal_length  petal_width
count      50.00000    50.000000     50.000000     50.00000
mean        6.58800     2.974000      5.552000      2.02600
std         0.63588     0.322497      0.551895      0.27465
min         4.90000     2.200000      4.500000      1.40000
25%         6.22500     2.800000      5.100000      1.80000
50%         6.50000     3.000000      5.550000      2.00000
75%         6.90000     3.175000      5.875000      2.30000
max         7.90000     3.800000      6.900000      2.50000